RastreamentoAcesso/app/controllers/acessos_controller.rb

	def index
			@todos = Acesso.group(:key)
---
SELECT "acessos".* FROM "acessos" GROUP BY "acessos"."id" ORDER BY "acessos"."id" ASC

	def create
		@acesso = Acesso.new(params.require(:acesso).permit!)
		if @acesso.save
---
INSERT INTO "acessos" ("key", "email", "path", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["key", "4"], ["email", ""], ["path", "www.testeRD.com.br/home"], ["date", "22/05/2017 22:22:22"], ["created_at", "2017-07-13 01:24:16.938761"], ["updated_at", "2017-07-13 01:24:16.938761"]]

	def show
		key = params[:key]
		@todos = Acesso.where(key: key).order("date desc")
---
SELECT "acessos".* FROM "acessos" WHERE "acessos"."key" = ? ORDER BY date desc  [["key", "1"]]